.src/192/index.org
#+TITLE: 192

- 班主任: 朱良斌
- 课代表: 许焕圣

  
* 笔记
** 2024-04-16 10:54:48

#+begin_src csx -n
  Point yuanlaidepianyi;
  bool 鼠标按下去了吗 = false;

  private void Form1_MouseDown(object sender, MouseEventArgs e)
  {
      鼠标按下去了吗 = true;
      yuanlaidepianyi = e.Location;
      //MessageBox.Show($"{MousePosition}, {e.Location}, {Location}");
  }

  private void Form1_MouseUp(object sender, MouseEventArgs e)
  {
      鼠标按下去了吗 = false;
  }

  private void Form1_MouseMove(object sender, MouseEventArgs e)
  {
      // MousePosition 是什么东西
      // e.Location 是什么玩意
      // 他们跟 this.Location 是什么关系
      if (鼠标按下去了吗)
      {
          Location = new Point
              (
              MousePosition.X - yuanlaidepianyi.X,
              MousePosition.Y - yuanlaidepianyi.Y
              );
      }
  }
#+end_src

** 2024-04-10 09:15:42
:PROPERTIES:
:ID:       20240410T091613.104984
:END:

小测验，温度转换 + 猜数字。详情见课本 21 页。

** 2024-04-09 10:24:50
:PROPERTIES:
:ID:       20240409T102501.823430
:END:

小测验，不规则的闹钟。详情见课本 22 页。

** 2024-04-03 09:26:26

关于跳动的心，需要掌握:
- 如何通过 FormBorderStyle 设置无标题窗体
- 如何通过 BackgroundImage 和 TransparentKey 设置不规则窗体
- 如何通过 Timer 与 Location/Size 等的配合，实现奇妙的互动行为
- 如何为窗体、控件绑定事件

本节课:
- 练习“跳动的心”
- 完成第一章课后题

** 2024-04-02 10:54:48

Tips:
- 对字符串表达式进行数学运算:
  : DataTable.Compute

** 2024-03-27 08:28:29

- 练习上次的内容，搞会
- 按照课本第10页，完成登录项目的编写
- 小小的挑战：跳动的心

