192/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-04-16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>192</title>
<meta name="author" content="31415929" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/asset/common.css?33445' />



</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">192</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcecfe29">1. 笔记</a>
<ul>
<li><a href="#org2cb6f14">1.1. 2024-04-16 10:54:48</a></li>
<li><a href="#org0ec5c7f">1.2. 2024-04-10 09:15:42</a></li>
<li><a href="#org4a1e152">1.3. 2024-04-09 10:24:50</a></li>
<li><a href="#org14d735d">1.4. 2024-04-03 09:26:26</a></li>
<li><a href="#org25d14b5">1.5. 2024-04-02 10:54:48</a></li>
<li><a href="#org30b5844">1.6. 2024-03-27 08:28:29</a></li>
<li><a href="#org2e51549">1.7. 2024-03-26 10:36:40</a></li>
<li><a href="#org7ebc4f2">1.8. 2024-03-20 14:58:37</a></li>
<li><a href="#org30e98f4">1.9. 2024-03-19 10:49:19</a></li>
<li><a href="#org2309290">1.10. 2024-03-13 08:31:23</a></li>
<li><a href="#orgd40edb2">1.11. 2024-03-12 11:07:40</a></li>
<li><a href="#orgbb73b3f">1.12. 2024-01-16 (寒假作业)</a></li>
<li><a href="#orgdd2b753">1.13. 2024-01-16 (期末成绩)</a></li>
<li><a href="#orgad105e2">1.14. 2023-12-26 (任务)</a></li>
<li><a href="#org64a4c8c">1.15. 2023-10-31 (任务)</a></li>
<li><a href="#org16fdc68">1.16. 2023-09-06 (任务)</a></li>
</ul>
</li>
<li><a href="#org366482f">2. 任务结果</a></li>
<li><a href="#org7ac10f0">3. 练习题</a>
<ul>
<li><a href="#orgdf99604">3.1. Winform练习题</a></li>
<li><a href="#org4d18255">3.2. 下面是一个求取 BMI 的控制台应用，请找出并修改所有 BUG</a></li>
</ul>
</li>
<li><a href="#org47c88af">4. 知识点</a>
<ul>
<li><a href="#org2d01e22">4.1. 将 string 转换为 double 有哪些方式?</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<ul class="org-ul">
<li>班主任: 朱良斌</li>
<li>课代表: 许焕圣</li>
</ul>


<section id="outline-container-orgcecfe29" class="outline-2">
<h2 id="orgcecfe29"><span class="section-number-2">1.</span> 笔记</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2cb6f14" class="outline-3">
<h3 id="org2cb6f14"><span class="section-number-3">1.1.</span> 2024-04-16 10:54:48</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-csx"><span class="linenr"> 1: </span><span style="color: #005a5f;">Point</span> <span style="color: #00538b;">yuanlaidepianyi</span>;
<span class="linenr"> 2: </span><span style="color: #005a5f;">bool</span> <span style="color: #00538b;">shibushianxiaqule</span> = <span style="color: #0000c0;">false</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">Form1_MouseMove</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">MouseEventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr"> 5: </span><span style="color: #000000;">{</span>
<span class="linenr"> 6: </span>    <span style="color: #505050;">// </span><span style="color: #505050;">MousePosition &#26159;&#20160;&#20040;&#19996;&#35199;</span>
<span class="linenr"> 7: </span>    <span style="color: #505050;">// </span><span style="color: #505050;">e.Location</span>
<span class="linenr"> 8: </span>    <span style="color: #5317ac;">if</span> <span style="color: #a8007f;">(</span>shibushianxiaqule<span style="color: #a8007f;">)</span>
<span class="linenr"> 9: </span>    <span style="color: #a8007f;">{</span>
<span class="linenr">10: </span>        Location = <span style="color: #5317ac;">new</span> <span style="color: #005a5f;">Point</span>
<span class="linenr">11: </span>            <span style="color: #005f88;">(</span>
<span class="linenr">12: </span>            MousePosition.X - yuanlaidepianyi.X,
<span class="linenr">13: </span>            MousePosition.Y - yuanlaidepianyi.Y
<span class="linenr">14: </span>            <span style="color: #005f88;">)</span>;
<span class="linenr">15: </span>    <span style="color: #a8007f;">}</span>
<span class="linenr">16: </span><span style="color: #000000;">}</span>
<span class="linenr">17: </span>
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">Form1_MouseDown</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">MouseEventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr">20: </span><span style="color: #000000;">{</span>
<span class="linenr">21: </span>    shibushianxiaqule = <span style="color: #0000c0;">true</span>;
<span class="linenr">22: </span>    yuanlaidepianyi = e.Location;
<span class="linenr">23: </span>    <span style="color: #505050;">//</span><span style="color: #505050;">MessageBox.Show($"{MousePosition}, {e.Location}, {Location}");</span>
<span class="linenr">24: </span><span style="color: #000000;">}</span>
<span class="linenr">25: </span>
<span class="linenr">26: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">Form1_MouseUp</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">MouseEventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr">27: </span><span style="color: #000000;">{</span>
<span class="linenr">28: </span>    shibushianxiaqule = <span style="color: #0000c0;">false</span>;
<span class="linenr">29: </span><span style="color: #000000;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ec5c7f" class="outline-3">
<h3 id="org0ec5c7f"><span class="section-number-3">1.2.</span> 2024-04-10 09:15:42</h3>
<div class="outline-text-3" id="text-1-2">
<p>
小测验，温度转换 + 猜数字。详情见课本 21 页。
</p>
</div>
</div>

<div id="outline-container-org4a1e152" class="outline-3">
<h3 id="org4a1e152"><span class="section-number-3">1.3.</span> 2024-04-09 10:24:50</h3>
<div class="outline-text-3" id="text-1-3">
<p>
小测验，不规则的闹钟。详情见课本 22 页。
</p>
</div>
</div>

<div id="outline-container-org14d735d" class="outline-3">
<h3 id="org14d735d"><span class="section-number-3">1.4.</span> 2024-04-03 09:26:26</h3>
<div class="outline-text-3" id="text-1-4">
<p>
关于跳动的心，需要掌握:
</p>
<ul class="org-ul">
<li>如何通过 FormBorderStyle 设置无标题窗体</li>
<li>如何通过 BackgroundImage 和 TransparentKey 设置不规则窗体</li>
<li>如何通过 Timer 与 Location/Size 等的配合，实现奇妙的互动行为</li>
<li>如何为窗体、控件绑定事件</li>
</ul>

<p>
本节课:
</p>
<ul class="org-ul">
<li>练习“跳动的心”</li>
<li>完成第一章课后题</li>
</ul>
</div>
</div>

<div id="outline-container-org25d14b5" class="outline-3">
<h3 id="org25d14b5"><span class="section-number-3">1.5.</span> 2024-04-02 10:54:48</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Tips:
</p>
<ul class="org-ul">
<li><p>
对字符串表达式进行数学运算:
</p>
<pre class="example">
DataTable.Compute
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org30b5844" class="outline-3">
<h3 id="org30b5844"><span class="section-number-3">1.6.</span> 2024-03-27 08:28:29</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>练习上次的内容，搞会</li>
<li>按照课本第10页，完成登录项目的编写</li>
<li>小小的挑战：跳动的心</li>
</ul>
</div>
</div>
