.src/192/index.org
** 2024-03-26 10:36:40

组件、控件、Control，在 C# 中，实际就是一个类的实例。

代码示例:
#+begin_src csx -n
  Timer timer;
  public Form1()
  {
      InitializeComponent();

      //定时器
      timer = new Timer();
      timer.Interval = 20;
      timer.Tick += sdfksdjfksd;
      timer.Start();
  }

  private void sdfksdjfksd(object sender, EventArgs e)
  {
      var loc = button1.Location;
      button1.Location = new Point(
          loc.X + 5 > 300 ? 0 : loc.X + 5,
          loc.Y + 1 > 200 ? 0 : loc.Y + 1);
  }

  private void Form1_Load(object sender, EventArgs e)
  {
      // 可以手动添加组件
    
      var button1 = new Button();
      button1.Text = "谢谢，安静";
      button1.Location = new Point(200, 300);

      var label = new Label();
      label.Text = "安静，谢谢";

      this.Controls.Add(button1);
      this.Controls.Add(label);

  }

  private void button2_Click(object sender, EventArgs e)
  {
      // 可以控制定时器的开始与结束
      timer.Enabled = !timer.Enabled;
  }
#+end_src

** 2024-03-20 14:58:37

一个小挑战。

一个应用程序，外观是一颗红色的心:
- 没有标题栏、关闭按钮等传统的窗口样式
- 不在任务栏显示
- 随着时间不断跳动 （变大、变小）
- 双击，会弹出一个窗口，输入正确的密码，才会结束

** 2024-03-19 10:49:19

实际上，一个窗体就是一个 C# 的类型。对应三个文件：
1. Form1.cs
2. Form1.Designer.cs
3. Form1.resx

通过 partial 分部类的方式，将不同部分的代码分离开来。

窗体的基本属性:
- FormBorderStyle
- Size/StartPosition/WindowState

窗体的基本方法:
- Hide/Close/Dispose
- Show/ShowDialog/Activate

常用事件:
- 窗体的加载时机: Load, FormClosed/FormClosing
- 鼠标动作: MouseClick/Down/Up, MouseEnter/Leave/Hover/Move
- 键盘动作: KeyPress/Down/Up
- 通用的动作: Click/DoubleClick

通过编码直接绑定事件:
#+begin_src csx -n
  private void Form1_Load(object sender, EventArgs e)
  {
      // 事件方法 (注意，通过 += 操作符添加事件)
      this.Click += 我是事件方法; 

      // 通过表达式语法
      this.Click += (object sender, EventArgs e) =>
      {
          MessageBox.Show("击");
      };
  }

  private void 我是事件方法(object sender, EventArgs e)
  {
      MessageBox.Show("ji");
  }
#+end_src

事件属性的使用示例:
#+begin_src csx -n
  private void Form2_MouseClick(object sender, MouseEventArgs e)
  {
      if (e.Button == MouseButtons.Left)
      {
          MessageBox.Show("我的左键被点击了");
      }
      else if (e.Button == MouseButtons.Right)
      {
          MessageBox.Show("你点我干啥");
      }
  }

  private void Form2_KeyDown(object sender, KeyEventArgs e)
  {
      if (e.KeyCode == Keys.H && e.Control)
      {
          MessageBox.Show("帮帮我");
      }
  }
#+end_src

