192/index.html

<div id="outline-container-org2e51549" class="outline-3">
<h3 id="org2e51549"><span class="section-number-3">1.7.</span> 2024-03-26 10:36:40</h3>
<div class="outline-text-3" id="text-1-7">
<p>
组件、控件、Control，在 C# 中，实际就是一个类的实例。
</p>

<p>
代码示例:
</p>
<div class="org-src-container">
<pre class="src src-csx"><span class="linenr"> 1: </span><span style="color: #005a5f;">Timer</span> <span style="color: #00538b;">timer</span>;
<span class="linenr"> 2: </span><span style="color: #5317ac;">public</span> <span style="color: #721045;">Form1</span><span style="color: #000000;">()</span>
<span class="linenr"> 3: </span><span style="color: #000000;">{</span>
<span class="linenr"> 4: </span>    <span style="color: #721045;">InitializeComponent</span><span style="color: #a8007f;">()</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    <span style="color: #505050;">//</span><span style="color: #505050;">&#23450;&#26102;&#22120;</span>
<span class="linenr"> 7: </span>    timer = <span style="color: #5317ac;">new</span> <span style="color: #005a5f;">Timer</span><span style="color: #a8007f;">()</span>;
<span class="linenr"> 8: </span>    timer.Interval = 20;
<span class="linenr"> 9: </span>    timer.Tick += sdfksdjfksd;
<span class="linenr">10: </span>    timer.<span style="color: #721045;">Start</span><span style="color: #a8007f;">()</span>;
<span class="linenr">11: </span><span style="color: #000000;">}</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">sdfksdjfksd</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">EventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr">14: </span><span style="color: #000000;">{</span>
<span class="linenr">15: </span>    <span style="color: #005a5f;">var</span> <span style="color: #00538b;">loc</span> = button1.Location;
<span class="linenr">16: </span>    button1.Location = <span style="color: #5317ac;">new</span> <span style="color: #005a5f;">Point</span><span style="color: #a8007f;">(</span>
<span class="linenr">17: </span>        loc.X + 5 &gt; 300 ? 0 : loc.X + 5,
<span class="linenr">18: </span>        loc.Y + 1 &gt; 200 ? 0 : loc.Y + 1<span style="color: #a8007f;">)</span>;
<span class="linenr">19: </span><span style="color: #000000;">}</span>
<span class="linenr">20: </span>
<span class="linenr">21: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">Form1_Load</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">EventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr">22: </span><span style="color: #000000;">{</span>
<span class="linenr">23: </span>    <span style="color: #505050;">// </span><span style="color: #505050;">&#21487;&#20197;&#25163;&#21160;&#28155;&#21152;&#32452;&#20214;</span>
<span class="linenr">24: </span>
<span class="linenr">25: </span>    <span style="color: #005a5f;">var</span> <span style="color: #00538b;">button1</span> = <span style="color: #5317ac;">new</span> <span style="color: #005a5f;">Button</span><span style="color: #a8007f;">()</span>;
<span class="linenr">26: </span>    button1.Text = <span style="color: #2544bb;">"&#35874;&#35874;&#65292;&#23433;&#38745;"</span>;
<span class="linenr">27: </span>    button1.Location = <span style="color: #5317ac;">new</span> <span style="color: #005a5f;">Point</span><span style="color: #a8007f;">(</span>200, 300<span style="color: #a8007f;">)</span>;
<span class="linenr">28: </span>
<span class="linenr">29: </span>    <span style="color: #005a5f;">var</span> <span style="color: #00538b;">label</span> = <span style="color: #5317ac;">new</span> <span style="color: #005a5f;">Label</span><span style="color: #a8007f;">()</span>;
<span class="linenr">30: </span>    label.Text = <span style="color: #2544bb;">"&#23433;&#38745;&#65292;&#35874;&#35874;"</span>;
<span class="linenr">31: </span>
<span class="linenr">32: </span>    <span style="color: #5317ac;">this</span>.Controls.<span style="color: #721045;">Add</span><span style="color: #a8007f;">(</span>button1<span style="color: #a8007f;">)</span>;
<span class="linenr">33: </span>    <span style="color: #5317ac;">this</span>.Controls.<span style="color: #721045;">Add</span><span style="color: #a8007f;">(</span>label<span style="color: #a8007f;">)</span>;
<span class="linenr">34: </span>
<span class="linenr">35: </span><span style="color: #000000;">}</span>
<span class="linenr">36: </span>
<span class="linenr">37: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">button2_Click</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">EventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr">38: </span><span style="color: #000000;">{</span>
<span class="linenr">39: </span>    <span style="color: #505050;">// </span><span style="color: #505050;">&#21487;&#20197;&#25511;&#21046;&#23450;&#26102;&#22120;&#30340;&#24320;&#22987;&#19982;&#32467;&#26463;</span>
<span class="linenr">40: </span>    timer.Enabled = <span style="color: #813e00;">!</span>timer.Enabled;
<span class="linenr">41: </span><span style="color: #000000;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ebc4f2" class="outline-3">
<h3 id="org7ebc4f2"><span class="section-number-3">1.8.</span> 2024-03-20 14:58:37</h3>
<div class="outline-text-3" id="text-1-8">
<p>
一个小挑战。
</p>

<p>
一个应用程序，外观是一颗红色的心:
</p>
<ul class="org-ul">
<li>没有标题栏、关闭按钮等传统的窗口样式</li>
<li>不在任务栏显示</li>
<li>随着时间不断跳动 （变大、变小）</li>
<li>双击，会弹出一个窗口，输入正确的密码，才会结束</li>
</ul>
</div>
</div>

<div id="outline-container-org30e98f4" class="outline-3">
<h3 id="org30e98f4"><span class="section-number-3">1.9.</span> 2024-03-19 10:49:19</h3>
<div class="outline-text-3" id="text-1-9">
<p>
实际上，一个窗体就是一个 C# 的类型。对应三个文件：
</p>
<ol class="org-ol">
<li>Form1.cs</li>
<li>Form1.Designer.cs</li>
<li>Form1.resx</li>
</ol>

<p>
通过 partial 分部类的方式，将不同部分的代码分离开来。
</p>

<p>
窗体的基本属性:
</p>
<ul class="org-ul">
<li>FormBorderStyle</li>
<li>Size/StartPosition/WindowState</li>
</ul>

<p>
窗体的基本方法:
</p>
<ul class="org-ul">
<li>Hide/Close/Dispose</li>
<li>Show/ShowDialog/Activate</li>
</ul>

<p>
常用事件:
</p>
<ul class="org-ul">
<li>窗体的加载时机: Load, FormClosed/FormClosing</li>
<li>鼠标动作: MouseClick/Down/Up, MouseEnter/Leave/Hover/Move</li>
<li>键盘动作: KeyPress/Down/Up</li>
<li>通用的动作: Click/DoubleClick</li>
</ul>

<p>
通过编码直接绑定事件:
</p>
<div class="org-src-container">
<pre class="src src-csx"><span class="linenr"> 1: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">Form1_Load</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">EventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr"> 2: </span><span style="color: #000000;">{</span>
<span class="linenr"> 3: </span>    <span style="color: #505050;">// </span><span style="color: #505050;">&#20107;&#20214;&#26041;&#27861; (&#27880;&#24847;&#65292;&#36890;&#36807; += &#25805;&#20316;&#31526;&#28155;&#21152;&#20107;&#20214;)</span>
<span class="linenr"> 4: </span>    <span style="color: #5317ac;">this</span>.Click += &#25105;&#26159;&#20107;&#20214;&#26041;&#27861;; 
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>    <span style="color: #505050;">// </span><span style="color: #505050;">&#36890;&#36807;&#34920;&#36798;&#24335;&#35821;&#27861;</span>
<span class="linenr"> 7: </span>    <span style="color: #5317ac;">this</span>.Click += <span style="color: #a8007f;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #00538b;">EventArgs</span> e<span style="color: #a8007f;">)</span> =&gt;
<span class="linenr"> 8: </span>    <span style="color: #a8007f;">{</span>
<span class="linenr"> 9: </span>        MessageBox.<span style="color: #721045;">Show</span><span style="color: #005f88;">(</span><span style="color: #2544bb;">"&#20987;"</span><span style="color: #005f88;">)</span>;
<span class="linenr">10: </span>    <span style="color: #a8007f;">}</span>;
<span class="linenr">11: </span><span style="color: #000000;">}</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">&#25105;&#26159;&#20107;&#20214;&#26041;&#27861;</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">EventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr">14: </span><span style="color: #000000;">{</span>
<span class="linenr">15: </span>    MessageBox.<span style="color: #721045;">Show</span><span style="color: #a8007f;">(</span><span style="color: #2544bb;">"ji"</span><span style="color: #a8007f;">)</span>;
<span class="linenr">16: </span><span style="color: #000000;">}</span>
</pre>
</div>

<p>
事件属性的使用示例:
</p>
<div class="org-src-container">
<pre class="src src-csx"><span class="linenr"> 1: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">Form2_MouseClick</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">MouseEventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr"> 2: </span><span style="color: #000000;">{</span>
<span class="linenr"> 3: </span>    <span style="color: #5317ac;">if</span> <span style="color: #a8007f;">(</span>e.Button == MouseButtons.Left<span style="color: #a8007f;">)</span>
<span class="linenr"> 4: </span>    <span style="color: #a8007f;">{</span>
<span class="linenr"> 5: </span>        MessageBox.<span style="color: #721045;">Show</span><span style="color: #005f88;">(</span><span style="color: #2544bb;">"&#25105;&#30340;&#24038;&#38190;&#34987;&#28857;&#20987;&#20102;"</span><span style="color: #005f88;">)</span>;
<span class="linenr"> 6: </span>    <span style="color: #a8007f;">}</span>
<span class="linenr"> 7: </span>    <span style="color: #5317ac;">else</span> <span style="color: #5317ac;">if</span> <span style="color: #a8007f;">(</span>e.Button == MouseButtons.Right<span style="color: #a8007f;">)</span>
<span class="linenr"> 8: </span>    <span style="color: #a8007f;">{</span>
<span class="linenr"> 9: </span>        MessageBox.<span style="color: #721045;">Show</span><span style="color: #005f88;">(</span><span style="color: #2544bb;">"&#20320;&#28857;&#25105;&#24178;&#21861;"</span><span style="color: #005f88;">)</span>;
<span class="linenr">10: </span>    <span style="color: #a8007f;">}</span>
<span class="linenr">11: </span><span style="color: #000000;">}</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">Form2_KeyDown</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">KeyEventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr">14: </span><span style="color: #000000;">{</span>
<span class="linenr">15: </span>    <span style="color: #5317ac;">if</span> <span style="color: #a8007f;">(</span>e.KeyCode == Keys.H &amp;&amp; e.Control<span style="color: #a8007f;">)</span>
<span class="linenr">16: </span>    <span style="color: #a8007f;">{</span>
<span class="linenr">17: </span>        MessageBox.<span style="color: #721045;">Show</span><span style="color: #005f88;">(</span><span style="color: #2544bb;">"&#24110;&#24110;&#25105;"</span><span style="color: #005f88;">)</span>;
<span class="linenr">18: </span>    <span style="color: #a8007f;">}</span>
<span class="linenr">19: </span><span style="color: #000000;">}</span>
</pre>
</div>
</div>
</div>
