.src/192/index.org
** 2024-03-13 08:31:23

上课了

控制台应用程序 (CLI)
- Console.XXX

GUI 程序 (Graphic User Interface):
- 有用户界面的程序
- Winform/WPF/MAUI.

创建 Windows 窗体项目之后:
- 中间是界面设计器
- 左边是工具箱
- 右上角是项目管理器
- 右下角是属性管理器

如果你的 VS 不是上述布局:
1. 通过菜单上的【视图】找回相应的功能
2. 通过菜单上的【窗口-重置窗口布局】的方式，恢复默认布局

基本步骤:
0. 拿出纸笔，设计程序界面
1. 创建项目
2. 拖拽控件
3. 修改属性
4. 完善交互逻辑

从工具箱每一个拖进来的东西，都叫做一个 *控件*:
- 实质上，一个控件就是一个 C# 类型 (class Button/Label...) 的实例
- 通过界面设计器，进行拖拽，实质上是 VS 帮助我们自动生成了一坨坨的代码
- 每一个控件都有一个 [Name] 的属性，这个是控件的唯一引用 ID。
  要养成一个好的习惯，就是将常用的控件，改一个合适的名字
- MessageBox.Show 对应的是控制台项目中的 Console.Write

{{{details(求取BMI，代码片段，仅供参考)}}}
#+begin_src csx -n
  private void button1_Click(object sender, EventArgs e)
  {
      double sg = double.Parse(sgBox.Text);
      double tz = double.Parse(tzBox.Text);
      double bmi = tz / sg / sg;

      string stzk = null;
      if (bmi < 18.5)
      {
          stzk = "过轻";
      }
      else if (bmi < 24)
      {
          stzk = "正常";
      }
      else if (bmi < 28)
      {
          stzk = "超重";
      }
      else
      {
          stzk = "肥胖";
      }

      string jg = $"您的BMI为{bmi}, 身体状况为[{stzk}]";
      //Console.WriteLine(jg);
      //MessageBox.Show(jg);
      jgLabel.Text = jg;
  }
#+end_src
{{{details(/)}}}

接下来:
- 练习 Winform 版的 BMI 计算器
- 对上述 BMI 计算器进行优化，增加用户体验 (重点是错误处理)
- 为上述 BMI 计算器，增加历史记录和历史显示功能
  : [2011.1.23 15:20:35]  身高: 1.55   体重: 66   BMI: 33   状况: 健康
  : [2012.3.13 12:20:35]  身高: 1.24   体重: 67   BMI: 32   状况: 肥胖
  : [2015.2.5  11:20:35]  身高: 1.65   体重: 68   BMI: 23   状况: 健康

** 2024-03-12 11:07:40

记住: *Console.ReadLine 方法，返回的是一个字符串类型!!!*
: string abc = Console.ReadLine();

字符串 (string) 和字符 (char) 是不一样的!!!

** 2024-01-16 (寒假作业)

C/S架构编程，做完第一章所有的上机题:
- 可选项，其他题也做
- 如果任务不饱和，可酌情做一下第二章

** 2024-01-16 (期末成绩)

# #+begin_src elisp :var tb=rs
#   (cl-loop with fn =
#            (lambda (line n)
#              (let ((f (nth n line))) (if (numberp f) (max 60 (- 101 f)) (if (> (length f) 0) 70 60))))
#            for line in tb
#            for f1 = (funcall fn line 2)
#            for f2 = (funcall fn line 3)
#            for f3 = (funcall fn line 4)
#            collect (list (nth 1 line) f1 f2 f3 (round (/ (+ f1 f2 f3) 3.0))) into rs
#            finally
#            (return
#             (cl-loop for i from 1
#                      for line in (cl-sort rs (lambda (x y) (> (nth 4 x) (nth 4 y))))
#                      collect (cons i line))))
# #+end_src

| 名次 | 名字   | Test1 | Test2 | Test3 | Final |
|-----+-------+-------+-------+-------+-------|
|   1 | 段文潇 |    99 |   100 |    99 |    99 |
|   2 | 李吉   |   100 |    89 |   100 |    96 |
|   3 | 许焕圣 |    94 |    95 |    97 |    95 |
|   4 | 高旻昱 |    96 |    97 |    93 |    95 |
|   5 | 古远东 |    83 |    93 |    96 |    91 |
|   6 | 肖义珥 |    91 |    90 |    92 |    91 |
|   7 | 何华为 |    93 |    94 |    87 |    91 |
|   8 | 刘广鸿 |    90 |    98 |    86 |    91 |
|   9 | 黄可彬 |    82 |    92 |    95 |    90 |
|  10 | 张甘霖 |    86 |    96 |    79 |    87 |
|  11 | 余海中 |    98 |    84 |    78 |    87 |
|  12 | 谭鑫   |    97 |    88 |    77 |    87 |
|  13 | 段京文 |    84 |    83 |    91 |    86 |
|  14 | 黄飞超 |    70 |    87 |    98 |    85 |
|  15 | 段文锋 |    88 |    99 |    67 |    85 |
|  16 | 刘虹佑 |    87 |    70 |    89 |    82 |
|  17 | 李泽俊 |    70 |    86 |    84 |    80 |
|  18 | 麦天河 |    95 |    70 |    75 |    80 |
|  19 | 韦金良 |    70 |    85 |    83 |    79 |
|  20 | 贝俊霖 |    70 |    70 |    94 |    78 |
|  21 | 陈颖聪 |    70 |    91 |    72 |    78 |
|  22 | 郭榕荣 |    70 |    70 |    90 |    77 |
|  23 | 梁泽文 |    70 |    70 |    88 |    76 |
|  24 | 李耀武 |    70 |    80 |    76 |    75 |
|  25 | 王海波 |    92 |    60 |    73 |    75 |
|  26 | 陈梓鑫 |    70 |    70 |    81 |    74 |
|  27 | 吴幸林 |    70 |    60 |    85 |    72 |
|  28 | 张桂毓 |    70 |    82 |    63 |    72 |
|  29 | 苏大明 |    70 |    60 |    82 |    71 |
|  30 | 唐景富 |    70 |    70 |    74 |    71 |
|  31 | 刘翔   |    89 |    60 |    65 |    71 |
|  32 | 刘泽泉 |    70 |    81 |    62 |    71 |
|  33 | 叶宇   |    70 |    60 |    80 |    70 |
|  34 | 谢晓中 |    70 |    70 |    71 |    70 |
|  35 | 陆宇轩 |    70 |    70 |    66 |    69 |
|  36 | 李岳元 |    85 |    60 |    61 |    69 |
|  37 | 周永久 |    70 |    70 |    64 |    68 |
|  38 | 饶展源 |    70 |    60 |    71 |    67 |
|  39 | 何晓东 |    70 |    70 |    60 |    67 |
|  40 | 沈艺宏 |    70 |    60 |    69 |    66 |
|  41 | 薛进超 |    70 |    60 |    68 |    66 |
|  42 | 卢德涛 |    70 |    70 |    60 |    66 |
|  43 | 岑法政 |    60 |    60 |    60 |    60 |

