192/index.html

<div id="outline-container-org2309290" class="outline-3">
<h3 id="org2309290"><span class="section-number-3">1.10.</span> 2024-03-13 08:31:23</h3>
<div class="outline-text-3" id="text-1-10">
<p>
上课了
</p>

<p>
控制台应用程序 (CLI)
</p>
<ul class="org-ul">
<li>Console.XXX</li>
</ul>

<p>
GUI 程序 (Graphic User Interface):
</p>
<ul class="org-ul">
<li>有用户界面的程序</li>
<li>Winform/WPF/MAUI.</li>
</ul>

<p>
创建 Windows 窗体项目之后:
</p>
<ul class="org-ul">
<li>中间是界面设计器</li>
<li>左边是工具箱</li>
<li>右上角是项目管理器</li>
<li>右下角是属性管理器</li>
</ul>

<p>
如果你的 VS 不是上述布局:
</p>
<ol class="org-ol">
<li>通过菜单上的【视图】找回相应的功能</li>
<li>通过菜单上的【窗口-重置窗口布局】的方式，恢复默认布局</li>
</ol>

<p>
基本步骤:
</p>
<ol class="org-ol">
<li>拿出纸笔，设计程序界面</li>
<li>创建项目</li>
<li>拖拽控件</li>
<li>修改属性</li>
<li>完善交互逻辑</li>
</ol>

<p>
从工具箱每一个拖进来的东西，都叫做一个 <b>控件</b>:
</p>
<ul class="org-ul">
<li>实质上，一个控件就是一个 C# 类型 (class Button/Label&#x2026;) 的实例</li>
<li>通过界面设计器，进行拖拽，实质上是 VS 帮助我们自动生成了一坨坨的代码</li>
<li>每一个控件都有一个 [Name] 的属性，这个是控件的唯一引用 ID。
要养成一个好的习惯，就是将常用的控件，改一个合适的名字</li>
<li>MessageBox.Show 对应的是控制台项目中的 Console.Write</li>
</ul>

<details><summary>求取BMI，代码片段，仅供参考</summary>
<div class="org-src-container">
<pre class="src src-csx"><span class="linenr"> 1: </span><span style="color: #5317ac;">private</span> <span style="color: #005a5f;">void</span> <span style="color: #721045;">button1_Click</span><span style="color: #000000;">(</span><span style="color: #005a5f;">object</span> <span style="color: #00538b;">sender</span>, <span style="color: #005a5f;">EventArgs</span> <span style="color: #00538b;">e</span><span style="color: #000000;">)</span>
<span class="linenr"> 2: </span><span style="color: #000000;">{</span>
<span class="linenr"> 3: </span>    <span style="color: #005a5f;">double</span> <span style="color: #00538b;">sg</span> = <span style="color: #005a5f;">double</span>.<span style="color: #721045;">Parse</span><span style="color: #a8007f;">(</span>sgBox.Text<span style="color: #a8007f;">)</span>;
<span class="linenr"> 4: </span>    <span style="color: #005a5f;">double</span> <span style="color: #00538b;">tz</span> = <span style="color: #005a5f;">double</span>.<span style="color: #721045;">Parse</span><span style="color: #a8007f;">(</span>tzBox.Text<span style="color: #a8007f;">)</span>;
<span class="linenr"> 5: </span>    <span style="color: #005a5f;">double</span> <span style="color: #00538b;">bmi</span> = tz / sg / sg;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #005a5f;">string</span> <span style="color: #00538b;">stzk</span> = <span style="color: #0000c0;">null</span>;
<span class="linenr"> 8: </span>    <span style="color: #5317ac;">if</span> <span style="color: #a8007f;">(</span>bmi &lt; 18.5<span style="color: #a8007f;">)</span>
<span class="linenr"> 9: </span>    <span style="color: #a8007f;">{</span>
<span class="linenr">10: </span>        stzk = <span style="color: #2544bb;">"&#36807;&#36731;"</span>;
<span class="linenr">11: </span>    <span style="color: #a8007f;">}</span>
<span class="linenr">12: </span>    <span style="color: #5317ac;">else</span> <span style="color: #5317ac;">if</span> <span style="color: #a8007f;">(</span>bmi &lt; 24<span style="color: #a8007f;">)</span>
<span class="linenr">13: </span>    <span style="color: #a8007f;">{</span>
<span class="linenr">14: </span>        stzk = <span style="color: #2544bb;">"&#27491;&#24120;"</span>;
<span class="linenr">15: </span>    <span style="color: #a8007f;">}</span>
<span class="linenr">16: </span>    <span style="color: #5317ac;">else</span> <span style="color: #5317ac;">if</span> <span style="color: #a8007f;">(</span>bmi &lt; 28<span style="color: #a8007f;">)</span>
<span class="linenr">17: </span>    <span style="color: #a8007f;">{</span>
<span class="linenr">18: </span>        stzk = <span style="color: #2544bb;">"&#36229;&#37325;"</span>;
<span class="linenr">19: </span>    <span style="color: #a8007f;">}</span>
<span class="linenr">20: </span>    <span style="color: #5317ac;">else</span>
<span class="linenr">21: </span>    <span style="color: #a8007f;">{</span>
<span class="linenr">22: </span>        stzk = <span style="color: #2544bb;">"&#32933;&#32982;"</span>;
<span class="linenr">23: </span>    <span style="color: #a8007f;">}</span>
<span class="linenr">24: </span>
<span class="linenr">25: </span>    <span style="color: #005a5f;">string</span> <span style="color: #00538b;">jg</span> = $<span style="color: #2544bb;">"&#24744;&#30340;BMI&#20026;{bmi}, &#36523;&#20307;&#29366;&#20917;&#20026;[{stzk}]"</span>;
<span class="linenr">26: </span>    <span style="color: #505050;">//</span><span style="color: #505050;">Console.WriteLine(jg);</span>
<span class="linenr">27: </span>    <span style="color: #505050;">//</span><span style="color: #505050;">MessageBox.Show(jg);</span>
<span class="linenr">28: </span>    jgLabel.Text = jg;
<span class="linenr">29: </span><span style="color: #000000;">}</span>
</pre>
</div>
</details>

<p>
接下来:
</p>
<ul class="org-ul">
<li>练习 Winform 版的 BMI 计算器</li>
<li>对上述 BMI 计算器进行优化，增加用户体验 (重点是错误处理)</li>
<li><p>
为上述 BMI 计算器，增加历史记录和历史显示功能
</p>
<pre class="example">
[2011.1.23 15:20:35]  身高: 1.55   体重: 66   BMI: 33   状况: 健康
[2012.3.13 12:20:35]  身高: 1.24   体重: 67   BMI: 32   状况: 肥胖
[2015.2.5  11:20:35]  身高: 1.65   体重: 68   BMI: 23   状况: 健康
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-orgd40edb2" class="outline-3">
<h3 id="orgd40edb2"><span class="section-number-3">1.11.</span> 2024-03-12 11:07:40</h3>
<div class="outline-text-3" id="text-1-11">
<p>
记住: <b>Console.ReadLine 方法，返回的是一个字符串类型!!!</b>
</p>
<pre class="example">
string abc = Console.ReadLine();
</pre>


<p>
字符串 (string) 和字符 (char) 是不一样的!!!
</p>
</div>
</div>

<div id="outline-container-orgbb73b3f" class="outline-3">
<h3 id="orgbb73b3f"><span class="section-number-3">1.12.</span> 2024-01-16 (寒假作业)</h3>
<div class="outline-text-3" id="text-1-12">
<p>
C/S架构编程，做完第一章所有的上机题:
</p>
<ul class="org-ul">
<li>可选项，其他题也做</li>
<li>如果任务不饱和，可酌情做一下第二章</li>
</ul>
</div>
</div>
