192/index.html

<div id="outline-container-orgdd2b753" class="outline-3">
<h3 id="orgdd2b753"><span class="section-number-3">1.13.</span> 2024-01-16 (期末成绩)</h3>
<div class="outline-text-3" id="text-1-13">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">名次</th>
<th scope="col" class="org-left">名字</th>
<th scope="col" class="org-right">Test1</th>
<th scope="col" class="org-right">Test2</th>
<th scope="col" class="org-right">Test3</th>
<th scope="col" class="org-right">Final</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">段文潇</td>
<td class="org-right">99</td>
<td class="org-right">100</td>
<td class="org-right">99</td>
<td class="org-right">99</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">李吉</td>
<td class="org-right">100</td>
<td class="org-right">89</td>
<td class="org-right">100</td>
<td class="org-right">96</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">许焕圣</td>
<td class="org-right">94</td>
<td class="org-right">95</td>
<td class="org-right">97</td>
<td class="org-right">95</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">高旻昱</td>
<td class="org-right">96</td>
<td class="org-right">97</td>
<td class="org-right">93</td>
<td class="org-right">95</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">古远东</td>
<td class="org-right">83</td>
<td class="org-right">93</td>
<td class="org-right">96</td>
<td class="org-right">91</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">肖义珥</td>
<td class="org-right">91</td>
<td class="org-right">90</td>
<td class="org-right">92</td>
<td class="org-right">91</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">何华为</td>
<td class="org-right">93</td>
<td class="org-right">94</td>
<td class="org-right">87</td>
<td class="org-right">91</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">刘广鸿</td>
<td class="org-right">90</td>
<td class="org-right">98</td>
<td class="org-right">86</td>
<td class="org-right">91</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">黄可彬</td>
<td class="org-right">82</td>
<td class="org-right">92</td>
<td class="org-right">95</td>
<td class="org-right">90</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">张甘霖</td>
<td class="org-right">86</td>
<td class="org-right">96</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">余海中</td>
<td class="org-right">98</td>
<td class="org-right">84</td>
<td class="org-right">78</td>
<td class="org-right">87</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">谭鑫</td>
<td class="org-right">97</td>
<td class="org-right">88</td>
<td class="org-right">77</td>
<td class="org-right">87</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">段京文</td>
<td class="org-right">84</td>
<td class="org-right">83</td>
<td class="org-right">91</td>
<td class="org-right">86</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">黄飞超</td>
<td class="org-right">70</td>
<td class="org-right">87</td>
<td class="org-right">98</td>
<td class="org-right">85</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">段文锋</td>
<td class="org-right">88</td>
<td class="org-right">99</td>
<td class="org-right">67</td>
<td class="org-right">85</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">刘虹佑</td>
<td class="org-right">87</td>
<td class="org-right">70</td>
<td class="org-right">89</td>
<td class="org-right">82</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-left">李泽俊</td>
<td class="org-right">70</td>
<td class="org-right">86</td>
<td class="org-right">84</td>
<td class="org-right">80</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">麦天河</td>
<td class="org-right">95</td>
<td class="org-right">70</td>
<td class="org-right">75</td>
<td class="org-right">80</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-left">韦金良</td>
<td class="org-right">70</td>
<td class="org-right">85</td>
<td class="org-right">83</td>
<td class="org-right">79</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-left">贝俊霖</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">94</td>
<td class="org-right">78</td>
</tr>

<tr>
<td class="org-right">21</td>
<td class="org-left">陈颖聪</td>
<td class="org-right">70</td>
<td class="org-right">91</td>
<td class="org-right">72</td>
<td class="org-right">78</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-left">郭榕荣</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">90</td>
<td class="org-right">77</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-left">梁泽文</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">88</td>
<td class="org-right">76</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-left">李耀武</td>
<td class="org-right">70</td>
<td class="org-right">80</td>
<td class="org-right">76</td>
<td class="org-right">75</td>
</tr>

<tr>
<td class="org-right">25</td>
<td class="org-left">王海波</td>
<td class="org-right">92</td>
<td class="org-right">60</td>
<td class="org-right">73</td>
<td class="org-right">75</td>
</tr>

<tr>
<td class="org-right">26</td>
<td class="org-left">陈梓鑫</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">81</td>
<td class="org-right">74</td>
</tr>

<tr>
<td class="org-right">27</td>
<td class="org-left">吴幸林</td>
<td class="org-right">70</td>
<td class="org-right">60</td>
<td class="org-right">85</td>
<td class="org-right">72</td>
</tr>

<tr>
<td class="org-right">28</td>
<td class="org-left">张桂毓</td>
<td class="org-right">70</td>
<td class="org-right">82</td>
<td class="org-right">63</td>
<td class="org-right">72</td>
</tr>

<tr>
<td class="org-right">29</td>
<td class="org-left">苏大明</td>
<td class="org-right">70</td>
<td class="org-right">60</td>
<td class="org-right">82</td>
<td class="org-right">71</td>
</tr>

<tr>
<td class="org-right">30</td>
<td class="org-left">唐景富</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">74</td>
<td class="org-right">71</td>
</tr>

<tr>
<td class="org-right">31</td>
<td class="org-left">刘翔</td>
<td class="org-right">89</td>
<td class="org-right">60</td>
<td class="org-right">65</td>
<td class="org-right">71</td>
</tr>

<tr>
<td class="org-right">32</td>
<td class="org-left">刘泽泉</td>
<td class="org-right">70</td>
<td class="org-right">81</td>
<td class="org-right">62</td>
<td class="org-right">71</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">叶宇</td>
<td class="org-right">70</td>
<td class="org-right">60</td>
<td class="org-right">80</td>
<td class="org-right">70</td>
</tr>

<tr>
<td class="org-right">34</td>
<td class="org-left">谢晓中</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">71</td>
<td class="org-right">70</td>
</tr>

<tr>
<td class="org-right">35</td>
<td class="org-left">陆宇轩</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">66</td>
<td class="org-right">69</td>
</tr>

<tr>
<td class="org-right">36</td>
<td class="org-left">李岳元</td>
<td class="org-right">85</td>
<td class="org-right">60</td>
<td class="org-right">61</td>
<td class="org-right">69</td>
</tr>

<tr>
<td class="org-right">37</td>
<td class="org-left">周永久</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">64</td>
<td class="org-right">68</td>
</tr>

<tr>
<td class="org-right">38</td>
<td class="org-left">饶展源</td>
<td class="org-right">70</td>
<td class="org-right">60</td>
<td class="org-right">71</td>
<td class="org-right">67</td>
</tr>

<tr>
<td class="org-right">39</td>
<td class="org-left">何晓东</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">60</td>
<td class="org-right">67</td>
</tr>

<tr>
<td class="org-right">40</td>
<td class="org-left">沈艺宏</td>
<td class="org-right">70</td>
<td class="org-right">60</td>
<td class="org-right">69</td>
<td class="org-right">66</td>
</tr>

<tr>
<td class="org-right">41</td>
<td class="org-left">薛进超</td>
<td class="org-right">70</td>
<td class="org-right">60</td>
<td class="org-right">68</td>
<td class="org-right">66</td>
</tr>

<tr>
<td class="org-right">42</td>
<td class="org-left">卢德涛</td>
<td class="org-right">70</td>
<td class="org-right">70</td>
<td class="org-right">60</td>
<td class="org-right">66</td>
</tr>

<tr>
<td class="org-right">43</td>
<td class="org-left">岑法政</td>
<td class="org-right">60</td>
<td class="org-right">60</td>
<td class="org-right">60</td>
<td class="org-right">60</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgad105e2" class="outline-3">
<h3 id="orgad105e2"><span class="section-number-3">1.14.</span> 2023-12-26 (任务)</h3>
<div class="outline-text-3" id="text-1-14">
<p>
使用 Winform 实现一个求取 BMI 的应用。要求设计合理，使用方便，美观大方
</p>
</div>
</div>

<div id="outline-container-org64a4c8c" class="outline-3">
<h3 id="org64a4c8c"><span class="section-number-3">1.15.</span> 2023-10-31 (任务)</h3>
<div class="outline-text-3" id="text-1-15">
<p>
创建类 PLC，描述设备的基本信息并添加基本控制
</p>
</div>
</div>

<div id="outline-container-org16fdc68" class="outline-3">
<h3 id="org16fdc68"><span class="section-number-3">1.16.</span> 2023-09-06 (任务)</h3>
<div class="outline-text-3" id="text-1-16">
<p>
1.hello.txt, 完成从创建文件、编译到运行的整个过程
</p>
</div>
</div>
</section>
