192/index.html


<section id="outline-container-org366482f" class="outline-2">
<h2 id="org366482f"><span class="section-number-2">2.</span> 任务结果</h2>
<div class="outline-text-2" id="text-2">
<table id="orgc0e687b">


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">G</th>
<th scope="col" class="org-left">姓名</th>
<th scope="col" class="org-right"><a href="#org4a1e152">2024-04-09</a></th>
<th scope="col" class="org-right"><a href="#org0ec5c7f">2024-04-10</a></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">李吉</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">许焕圣</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">何华为</td>
<td class="org-right">3</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">韦金良</td>
<td class="org-right">4</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">肖义珥</td>
<td class="org-right">5</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">高旻昱</td>
<td class="org-right">6</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">刘广鸿</td>
<td class="org-right">7</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">段文潇</td>
<td class="org-right">8</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">贝俊霖</td>
<td class="org-right">9</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">黄可彬</td>
<td class="org-right">10</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">李泽俊</td>
<td class="org-right">11</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">李耀武</td>
<td class="org-right">12</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">黄飞超</td>
<td class="org-right">13</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">古远东</td>
<td class="org-right">14</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">唐景富</td>
<td class="org-right">15</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">郭榕荣</td>
<td class="org-right">16</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">陈颖聪</td>
<td class="org-right">17</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">段京文</td>
<td class="org-right">18</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">陆宇轩</td>
<td class="org-right">19</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">刘虹佑</td>
<td class="org-right">20</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">段文锋</td>
<td class="org-right">21</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">岑法政</td>
<td class="org-right">22</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">薛进超</td>
<td class="org-right">23</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">谭鑫</td>
<td class="org-right">24</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">余海中</td>
<td class="org-right">25</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">梁泽文</td>
<td class="org-right">26</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">吴幸林</td>
<td class="org-right">27</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">张甘霖</td>
<td class="org-right">28</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">苏大明</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">陈梓鑫</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">叶宇</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">麦天河</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">王海波</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">饶展源</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">沈艺宏</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">刘翔</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">周永久</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">张桂毓</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">刘泽泉</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">李岳元</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">何晓东</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">卢德涛</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>


<details><summary>history score</summary>

<table id="org39c3128">


<colgroup>
<col  class="org-right">

<col  class="org-left">

<col  class="org-left">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">G</th>
<th scope="col" class="org-left">姓名</th>
<th scope="col" class="org-left"><a href="#org16fdc68">2023-09-06</a></th>
<th scope="col" class="org-right"><a href="#org64a4c8c">2023-10-31</a></th>
<th scope="col" class="org-right"><a href="#orgad105e2">2023-12-26</a></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">李吉</td>
<td class="org-left">1</td>
<td class="org-right">12</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">段文潇</td>
<td class="org-left">2</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">黄飞超</td>
<td class="org-left">-</td>
<td class="org-right">14</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">许焕圣</td>
<td class="org-left">7</td>
<td class="org-right">6</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">古远东</td>
<td class="org-left">18</td>
<td class="org-right">8</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">黄可彬</td>
<td class="org-left">19</td>
<td class="org-right">9</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">贝俊霖</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">高旻昱</td>
<td class="org-left">5</td>
<td class="org-right">4</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">肖义珥</td>
<td class="org-left">10</td>
<td class="org-right">11</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">段京文</td>
<td class="org-left">17</td>
<td class="org-right">18</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">郭榕荣</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">11</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">刘虹佑</td>
<td class="org-left">14</td>
<td class="org-right">-</td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">梁泽文</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">13</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">何华为</td>
<td class="org-left">8</td>
<td class="org-right">7</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">刘广鸿</td>
<td class="org-left">11</td>
<td class="org-right">3</td>
<td class="org-right">15</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">吴幸林</td>
<td class="org-left">-</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">16</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">李泽俊</td>
<td class="org-left">-</td>
<td class="org-right">15</td>
<td class="org-right">17</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">韦金良</td>
<td class="org-left">-</td>
<td class="org-right">16</td>
<td class="org-right">18</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">苏大明</td>
<td class="org-left">-</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">19</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">陈梓鑫</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">叶宇</td>
<td class="org-left">-</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">21</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">张甘霖</td>
<td class="org-left">15</td>
<td class="org-right">5</td>
<td class="org-right">22</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">余海中</td>
<td class="org-left">3</td>
<td class="org-right">17</td>
<td class="org-right">23</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">谭鑫</td>
<td class="org-left">4</td>
<td class="org-right">13</td>
<td class="org-right">24</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">李耀武</td>
<td class="org-left">-</td>
<td class="org-right">21</td>
<td class="org-right">25</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">麦天河</td>
<td class="org-left">6</td>
<td class="org-right">-</td>
<td class="org-right">26</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">唐景富</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">27</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">王海波</td>
<td class="org-left">9</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">28</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">陈颖聪</td>
<td class="org-left">-</td>
<td class="org-right">10</td>
<td class="org-right">29</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">饶展源</td>
<td class="org-left">-</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">谢晓中</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">沈艺宏</td>
<td class="org-left">-</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">32</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">薛进超</td>
<td class="org-left">-</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">33</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">段文锋</td>
<td class="org-left">13</td>
<td class="org-right">2</td>
<td class="org-right">34</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">陆宇轩</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">35</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">刘翔</td>
<td class="org-left">12</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">36</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">周永久</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">37</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">张桂毓</td>
<td class="org-left">-</td>
<td class="org-right">19</td>
<td class="org-right">38</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">刘泽泉</td>
<td class="org-left">-</td>
<td class="org-right">20</td>
<td class="org-right">39</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">李岳元</td>
<td class="org-left">16</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">40</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">何晓东</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">41</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">卢德涛</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
<td class="org-right">42</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">岑法政</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

</details>
</div>
</section>

<section id="outline-container-org7ac10f0" class="outline-2">
<h2 id="org7ac10f0"><span class="section-number-2">3.</span> 练习题</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgdf99604" class="outline-3">
<h3 id="orgdf99604"><span class="section-number-3">3.1.</span> Winform练习题</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>创建一个简单的登录窗体，包含用户名和密码的文本框，以及登录按钮。
当用户点击登录按钮时，检查用户名和密码是否正确，并显示相应的提示信息。</li>
<li>创建一个计算器窗体，包含数字按钮和运算符按钮。当用户点击数字按钮时，在文本框中显示相应的数字。
当用户点击运算符按钮时，根据当前显示的数字和运算符进行计算，并在文本框中显示结果。</li>
<li>创建一个列表窗体，用于显示学生的姓名和成绩。窗体中包含一个添加按钮和一个显示按钮。
当用户点击添加按钮时，弹出一个对话框，要求输入学生的姓名和成绩，并将其添加到列表中。当用户点击显示按钮时，在另一个窗体中显示所有学生的姓名和成绩。</li>
<li>创建一个简单的音乐播放器窗体，包含播放、暂停和停止按钮，以及显示当前播放状态的标签。
当用户点击播放按钮时，播放音乐；点击暂停按钮时，暂停音乐；点击停止按钮时，停止音乐。</li>
<li>创建一个简单的图片浏览器窗体，包含向前、向后按钮和显示当前图片的图片框。
当用户点击向前按钮时，显示上一张图片；点击向后按钮时，显示下一张图片。</li>
<li>创建一个简单的文本编辑器窗体，可以打开和保存文本文件。窗体包含一个文本框用于输入和编辑文本内容，以及打开和保存按钮。
当用户点击打开按钮时，弹出一个对话框选择要打开的文本文件，并将其内容显示在文本框中。当用户点击保存按钮时，将文本框中的内容保存到指定的文件中。</li>
<li>创建一个简单的倒计时器窗体，可以设置倒计时时间，并显示倒计时的剩余时间。
窗体包含一个输入框用于设置倒计时时间，一个开始按钮和一个显示剩余时间的标签。
当用户点击开始按钮时，开始倒计时，并在标签中显示剩余时间，直到倒计时结束。</li>
<li>创建一个简单的日历窗体，显示当前日期和时间，并允许用户选择日期。
窗体包含一个显示当前日期和时间的标签，以及一个选择日期的日历控件。</li>
<li>创建一个简单的笔记本应用程序窗体，可以创建、打开和保存笔记。
窗体包含一个文本框用于输入和编辑笔记内容，以及新建、打开和保存按钮。
当用户点击新建按钮时，清空文本框内容；当用户点击打开按钮时，弹出一个对话框选择要打开的笔记文件，并将其内容显示在文本框中；
当用户点击保存按钮时，将文本框中的内容保存到指定的文件中。</li>
<li>创建一个简单的待办事项列表窗体，可以添加、删除和完成待办事项。
窗体包含一个文本框用于输入待办事项，一个添加按钮和一个待办事项列表框。
当用户点击添加按钮时，将输入的待办事项添加到列表框中；
当用户选中列表框中的待办事项并点击删除按钮时，删除选中的待办事项；
当用户选中列表框中的待办事项并点击完成按钮时，将选中的待办事项标记为已完成。</li>
</ol>
</div>
</div>
