.src/192/index.org
* 知识点
** 将 string 转换为 double 有哪些方式?

在 C# 中，转换 string 为 double 的方式主要有三种:

1. 使用 *double.Parse* 方法，例如：

  #+begin_src csharp
    string numberString = "123.45";
    double number = double.Parse(numberString);
    Console.WriteLine(number);
  #+end_src
  
  如果字符串不能被解析为 double，此方法会抛出一个异常。

  {{{details(如果带异常处理的话，代码应该是这样的)}}}
  #+begin_src csharp
    // 使用异常处理机制 try/catch
    string numberString = "1g3.45";
    double number;
    try
    {
        number = double.Parse(numberString);
        Console.WriteLine(number);
    }
    catch
    {
        Console.WriteLine("您的输入有误");
    }
  #+end_src
  {{{details(/)}}}

2. 使用 *double.TryParse* 方法，例如：

  #+begin_src csharp
    string numberString = "123.45";
    double number;
    bool isParsed = double.TryParse(numberString, out number);
    Console.WriteLine(isParsed ? number : "失败了");
  #+end_src
  
  此方法会尝试将字符串解析为 double，如果不成功，此方法不会抛出异常，而是将输出变量设为 0，并且返回 false。

  这种方式不使用 try/catch 机制，代码看起来更简洁灵活。

3. 使用 *Convert.ToDouble* 方法，例如：

  #+begin_src csharp
    string numberString = "123.45";
    double number = Convert.ToDouble(numberString);
    Console.WriteLine(number);
  #+end_src
  
  事实上 =Convert.ToDouble= 方法在内部使用的也是 =double.Parse= ，因此如果转换失败，它将抛出一个异常。

