192/index.html

<section id="outline-container-org47c88af" class="outline-2">
<h2 id="org47c88af"><span class="section-number-2">4.</span> 知识点</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org2d01e22" class="outline-3">
<h3 id="org2d01e22"><span class="section-number-3">4.1.</span> 将 string 转换为 double 有哪些方式?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
在 C# 中，转换 string 为 double 的方式主要有三种:
</p>

<ol class="org-ol">
<li><p>
使用 <b>double.Parse</b> 方法，例如：
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #005a5f;">string</span> <span style="color: #00538b;">numberString</span> = <span style="color: #2544bb;">"123.45"</span>;
<span style="color: #005a5f;">double</span> <span style="color: #00538b;">number</span> = <span style="color: #005a5f;">double</span>.<span style="color: #721045;">Parse</span><span style="color: #000000;">(</span>numberString<span style="color: #000000;">)</span>;
Console.<span style="color: #721045;">WriteLine</span><span style="color: #000000;">(</span>number<span style="color: #000000;">)</span>;
</pre>
</div>

<p>
如果字符串不能被解析为 double，此方法会抛出一个异常。
</p>

<details><summary>如果带异常处理的话，代码应该是这样的</summary>
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #505050;">// </span><span style="color: #505050;">&#20351;&#29992;&#24322;&#24120;&#22788;&#29702;&#26426;&#21046; try/catch</span>
<span style="color: #005a5f;">string</span> <span style="color: #00538b;">numberString</span> = <span style="color: #2544bb;">"1g3.45"</span>;
<span style="color: #005a5f;">double</span> <span style="color: #00538b;">number</span>;
<span style="color: #5317ac;">try</span>
<span style="color: #000000;">{</span>
    number = <span style="color: #005a5f;">double</span>.<span style="color: #721045;">Parse</span><span style="color: #a8007f;">(</span>numberString<span style="color: #a8007f;">)</span>;
    Console.<span style="color: #721045;">WriteLine</span><span style="color: #a8007f;">(</span>number<span style="color: #a8007f;">)</span>;
<span style="color: #000000;">}</span>
<span style="color: #5317ac;">catch</span>
<span style="color: #000000;">{</span>
    Console.<span style="color: #721045;">WriteLine</span><span style="color: #a8007f;">(</span><span style="color: #2544bb;">"&#24744;&#30340;&#36755;&#20837;&#26377;&#35823;"</span><span style="color: #a8007f;">)</span>;
<span style="color: #000000;">}</span>
</pre>
</div>
</details></li>

<li><p>
使用 <b>double.TryParse</b> 方法，例如：
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #005a5f;">string</span> <span style="color: #00538b;">numberString</span> = <span style="color: #2544bb;">"123.45"</span>;
<span style="color: #005a5f;">double</span> <span style="color: #00538b;">number</span>;
<span style="color: #005a5f;">bool</span> <span style="color: #00538b;">isParsed</span> = <span style="color: #005a5f;">double</span>.<span style="color: #721045;">TryParse</span><span style="color: #000000;">(</span>numberString, <span style="color: #5317ac;">out</span> <span style="color: #005a5f;">number</span><span style="color: #000000;">)</span>;
Console.<span style="color: #721045;">WriteLine</span><span style="color: #000000;">(</span>isParsed ? <span style="color: #005a5f;">number</span> : <span style="color: #2544bb;">"&#22833;&#36133;&#20102;"</span><span style="color: #000000;">)</span>;
</pre>
</div>

<p>
此方法会尝试将字符串解析为 double，如果不成功，此方法不会抛出异常，而是将输出变量设为 0，并且返回 false。
</p>

<p>
这种方式不使用 try/catch 机制，代码看起来更简洁灵活。
</p></li>

<li><p>
使用 <b>Convert.ToDouble</b> 方法，例如：
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #005a5f;">string</span> <span style="color: #00538b;">numberString</span> = <span style="color: #2544bb;">"123.45"</span>;
<span style="color: #005a5f;">double</span> <span style="color: #00538b;">number</span> = Convert.<span style="color: #721045;">ToDouble</span><span style="color: #000000;">(</span>numberString<span style="color: #000000;">)</span>;
Console.<span style="color: #721045;">WriteLine</span><span style="color: #000000;">(</span>number<span style="color: #000000;">)</span>;
</pre>
</div>

<p>
事实上 <code>Convert.ToDouble</code> 方法在内部使用的也是 <code>double.Parse</code> ，因此如果转换失败，它将抛出一个异常。
</p></li>
</ol>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 31415929</p>
<p class="date">Created: 2024-04-16</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>